#include <stdio.h>
#include <windows.h>

int main() {
    // Русский язык
    SetConsoleOutputCP(CP_UTF8);

    // Объявление и ввод переменной
    int n;
    printf("Введите свой возраст:\n");
    scanf("%d", &n);

    // Проверка последней цифры, если последняя цифра 1, то окончание год, если 2, 3, 4, то окончание года, иначе лет
    // Также проверка на возраст от 11 до 20 лет, так как это исключения
    if (n % 10 == 1 && n % 100 != 11)
        printf("Мне %d год\n", n);
    else if (n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 10 || n % 100 >= 20))
        printf("Мне %d года\n", n);
    else
        printf("Мне %d лет\n", n);

    return 0;
}