#include <stdio.h>
#include <windows.h>

int main() {
    // Русский язык
    SetConsoleOutputCP(CP_UTF8);

    // Объявление переменных
    double p; // Первоначальный объем древесины в кубометрах
    double k; // Ежегодный прирост в процентах
    double t; // Годовой план заготовки в кубометрах
    int years = 0; // Счетчик лет

    // Ввод данных
    printf("Введите первоначальный объем древесины в кубометрах:\n");
    scanf("%lf", &p);
    printf("Введите ежегодный прирост в процентах:\n");
    scanf("%lf", &k);
    printf("Введите годовой план заготовки в кубометрах:\n");
    scanf("%lf", &t);

    // Проверка на возможность бесконечной вырубки леса
    if(p * (k / 100) - t > 0){
        printf("Опята не смогут захватить лес.");
        return 0;
    }

    // Расчет количества лет до исчезновения древесины
    while (p > 0) {
        p += p * (k / 100) - t;
        years++;
    }

    // Вывод результата на экран
    printf("Через %d лет в бывшем лесу будут расти одни опята.\n", years);

    return 0;
}